---
kind: method
id: M:Autodesk.Revit.DB.Units.GetModifiableSpecs
source: html/e7ff5a7e-ceb6-0349-2fa1-315704136c19.htm
---
# Autodesk.Revit.DB.Units.GetModifiableSpecs Method

Gets all specs for which the default FormatOptions can be modified.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetModifiableSpecs()
```

## Returns
Identifiers of the specs for which the FormatOptions can be modified.